ИС_СПОРТ_2022/src/Catalogs/УчебныеУчреждения/УчебныеУчреждения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УчебныеУчреждения</name>
  <owners>Catalog.Организации</owners>
  <attributes>
    <name>Директор</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолноеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УчебноеУчреждениеИзРеестра</name>
    <type>
      <types>CatalogRef.РеестрУчебныхУчреждений</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ИС_СПОРТ_2022/src/Catalogs/УчебныеУчреждения/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// {Рарус ivaart IN-19940 Скрыть поле для методистов  2021.09.02
	Организация = ПараметрыСеанса.ТекущаяОрганизация;
	Если Не Организация.Пустая() тогда
		Объект.Владелец = Организация;
		Элементы.Владелец.Видимость = Ложь;
	КонецЕсли;
	// }Рарус ivaart IN-19940 Скрыть поле для методистов  2021.09.02
	
	// СтандартныеПодсистемы.КонтактнаяИнформация
	ДополнительныеПараметры = УправлениеКонтактнойИнформацией.ПараметрыКонтактнойИнформации();
	ДополнительныеПараметры.ИмяЭлементаДляРазмещения = "ГруппаКонтактнаяИнформация";
	ДополнительныеПараметры.ПоложениеЗаголовкаКИ = ПоложениеЗаголовкаЭлементаФормы.Лево;
	
	УправлениеКонтактнойИнформацией.ПриСозданииНаСервере(ЭтотОбъект, Объект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.КонтактнаяИнформация

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.КонтактнаяИнформация
	УправлениеКонтактнойИнформацией.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.КонтактнаяИнформация

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.КонтактнаяИнформация
	УправлениеКонтактнойИнформацией.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.КонтактнаяИнформация

КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.КонтактнаяИнформация
	УправлениеКонтактнойИнформацией.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.КонтактнаяИнформация

КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	// СтандартныеПодсистемы.КонтактнаяИнформация
	УправлениеКонтактнойИнформацией.ОбработкаПроверкиЗаполненияНаСервере(ЭтотОбъект, Объект, Отказ);
	// Конец СтандартныеПодсистемы.КонтактнаяИнформация
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ПОДСИСТЕМЫ "КОНТАКТНАЯ ИНФОРМАЦИЯ"

// СтандартныеПодсистемы.КонтактнаяИнформация

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияПриИзменении(Элемент)
	
	УправлениеКонтактнойИнформациейКлиент.ПриИзменении(ЭтотОбъект, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияПриНажатии(Элемент, СтандартнаяОбработка)
	
	УправлениеКонтактнойИнформациейКлиент.НачалоВыбора(ЭтотОбъект, Элемент, , СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	УправлениеКонтактнойИнформациейКлиент.НачалоВыбора(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияОчистка(Элемент, СтандартнаяОбработка)
	
	УправлениеКонтактнойИнформациейКлиент.Очистка(ЭтотОбъект, Элемент.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияВыполнитьКоманду(Команда)
	
	УправлениеКонтактнойИнформациейКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда.Имя);
	
КонецПроцедуры

&НаСервере
Функция Подключаемый_ОбновитьКонтактнуюИнформацию(Результат) Экспорт
	
	РезультатОбновления = УправлениеКонтактнойИнформацией.ОбновитьКонтактнуюИнформацию(ЭтотОбъект, Объект, Результат);
	
	Возврат РезультатОбновления;
	
КонецФункции

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	МодульУправлениеКонтактнойИнформациейКлиент =
		ОбщегоНазначенияКлиент.ОбщийМодуль("УправлениеКонтактнойИнформациейКлиент");
	МодульУправлениеКонтактнойИнформациейКлиент.АвтоПодборАдреса(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	МодульУправлениеКонтактнойИнформациейКлиент =
		ОбщегоНазначенияКлиент.ОбщийМодуль("УправлениеКонтактнойИнформациейКлиент");
	МодульУправлениеКонтактнойИнформациейКлиент.ОбработкаВыбора(ЭтотОбъект, ВыбранноеЗначение, Элемент.Имя, СтандартнаяОбработка);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.КонтактнаяИнформация

// {Рарус dotere #21382 -Заполненеие данных их реестра 2021.10.14
&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	Оповещение = Новый ОписаниеОповещения("ПослеОтветаНаВопросОЗаполненииИзРеестраУчебныхУчереждений", ЭтотОбъект);
	ПоказатьВопрос(Оповещение, НСтр("ru = 'Заполнить данные автоматически?'"), РежимДиалогаВопрос.ДаНет,0);
КонецПроцедуры

&НаКлиенте
Процедура ПослеОтветаНаВопросОЗаполненииИзРеестраУчебныхУчереждений(Результат, Параметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		ПолучитьКонтактныеДанные();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПолучитьКонтактныеДанные()
	Если Не Объект.УчебноеУчреждениеИзРеестра.Пустая() Тогда
		УчереждениеИзРеестра = Объект.УчебноеУчреждениеИзРеестра.ПолучитьОбъект();
		Объект.ПолноеНаименование = УчереждениеИзРеестра.ПолноеНаименование;
		Объект.Наименование = УчереждениеИзРеестра.Наименование;
		КонтИнформация = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Объект.УчебноеУчреждениеИзРеестра,"",ТекущаяДатаСеанса(),Ложь);
		Объект.КонтактнаяИнформация.Загрузить(КонтИнформация);
		ЭтаФорма.КонтактнаяИнформацияПоле92ac72cdx9b29x11eaxa21ax00155d1eed181 = "";
		ЭтаФорма.КонтактнаяИнформацияПоле92ac72d7x9b29x11eaxa21ax00155d1eed181 = "";
		ЭтаФорма.КонтактнаяИнформацияПоле92ac72d3x9b29x11eaxa21ax00155d1eed181 = "";
		ЭтаФорма.КонтактнаяИнформацияПоле92ac72cex9b29x11eaxa21ax00155d1eed181 = "";
		ЭтаФорма.КонтактнаяИнформацияПоле92ac72d1x9b29x11eaxa21ax00155d1eed181 = "";
		ЭтаФорма.КонтактнаяИнформацияПоле92ac72cfx9b29x11eaxa21ax00155d1eed181 = "";
		ЭтаФорма.КонтактнаяИнформацияПоле92ac72d5x9b29x11eaxa21ax00155d1eed181 = "";
		Для каждого ИформацияИзРеестра Из КонтИнформация Цикл
			Если ИформацияИзРеестра.Вид = Справочники.ВидыКонтактнойИнформации.ФаксРеестрУчебныхУчреждений Тогда
				 ЭтаФорма.КонтактнаяИнформацияПоле92ac72cdx9b29x11eaxa21ax00155d1eed181 = ИформацияИзРеестра.Представление;
			ИначеЕсли ИформацияИзРеестра.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонРеестрУчебныхУчреждений Тогда
				 ЭтаФорма.КонтактнаяИнформацияПоле92ac72d7x9b29x11eaxa21ax00155d1eed181 = ИформацияИзРеестра.Представление;
			ИначеЕсли ИформацияИзРеестра.Вид = Справочники.ВидыКонтактнойИнформации.EmailРеестраУчебныхУчреждений Тогда
				 ЭтаФорма.КонтактнаяИнформацияПоле92ac72d3x9b29x11eaxa21ax00155d1eed181 = ИформацияИзРеестра.Представление;
			ИначеЕсли ИформацияИзРеестра.Вид = Справочники.ВидыКонтактнойИнформации.ПочтовыйАдресРеестраУчебныхУчреждений Тогда
				 ЭтаФорма.КонтактнаяИнформацияПоле92ac72cex9b29x11eaxa21ax00155d1eed181 = ИформацияИзРеестра.Представление;
			ИначеЕсли ИформацияИзРеестра.Вид = Справочники.ВидыКонтактнойИнформации.ДругаяИнформацияРеестрУчебныхУчреждений Тогда
				 ЭтаФорма.КонтактнаяИнформацияПоле92ac72d1x9b29x11eaxa21ax00155d1eed181 = ИформацияИзРеестра.Представление;
			ИначеЕсли ИформацияИзРеестра.Вид = Справочники.ВидыКонтактнойИнформации.ЮрАдресРеестрУчебныхУчреждений Тогда
				 ЭтаФорма.КонтактнаяИнформацияПоле92ac72cfx9b29x11eaxa21ax00155d1eed181 = ИформацияИзРеестра.Представление;
			ИначеЕсли ИформацияИзРеестра.Вид = Справочники.ВидыКонтактнойИнформации.ФактАдресРеестрУчебныхУчреждений Тогда
				 ЭтаФорма.КонтактнаяИнформацияПоле92ac72d5x9b29x11eaxa21ax00155d1eed181 = ИформацияИзРеестра.Представление;
			КонецЕсли
		КонецЦикла;
		Для каждого Контакт Из этаформа.КонтактнаяИнформацияОписаниеДополнительныхРеквизитов Цикл
			Контакт.Значение = "";
			Контакт.Представление = "";
			Для Каждого ИформацияИзРеестра Из КонтИнформация Цикл
				Если ИформацияИзРеестра.Вид = Справочники.ВидыКонтактнойИнформации.ФаксРеестрУчебныхУчреждений И Контакт.Вид = Справочники.ВидыКонтактнойИнформации.ФаксУчебныеУчреждения  Тогда
					 Контакт.Значение = ИформацияИзРеестра.Значение;
					 Контакт.Представление = ИформацияИзРеестра.Представление;
				ИначеЕсли ИформацияИзРеестра.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонРеестрУчебныхУчреждений И Контакт.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонУчебныеУчреждения Тогда
					 Контакт.Значение = ИформацияИзРеестра.Значение;
					 Контакт.Представление = ИформацияИзРеестра.Представление;
				ИначеЕсли ИформацияИзРеестра.Вид = Справочники.ВидыКонтактнойИнформации.EmailРеестраУчебныхУчреждений И Контакт.Вид = Справочники.ВидыКонтактнойИнформации.EmailУчебногоУчреждения Тогда
					 Контакт.Значение = ИформацияИзРеестра.Значение;
					 Контакт.Представление = ИформацияИзРеестра.Представление;
				ИначеЕсли ИформацияИзРеестра.Вид = Справочники.ВидыКонтактнойИнформации.ПочтовыйАдресРеестраУчебныхУчреждений И Контакт.Вид = Справочники.ВидыКонтактнойИнформации.ПочтовыйАдресУчебногоУчреждения Тогда
					 Контакт.Значение = ИформацияИзРеестра.Значение;
					 Контакт.Представление = ИформацияИзРеестра.Представление;
				ИначеЕсли ИформацияИзРеестра.Вид = Справочники.ВидыКонтактнойИнформации.ДругаяИнформацияРеестрУчебныхУчреждений И Контакт.Вид = Справочники.ВидыКонтактнойИнформации.ДругаяИнформацияУчебныеУчреждения Тогда
					 Контакт.Значение = ИформацияИзРеестра.Значение;
					 Контакт.Представление = ИформацияИзРеестра.Представление;
				ИначеЕсли ИформацияИзРеестра.Вид = Справочники.ВидыКонтактнойИнформации.ЮрАдресРеестрУчебныхУчреждений И Контакт.Вид = Справочники.ВидыКонтактнойИнформации.ЮрАдресУчебныеУчреждения Тогда
					 Контакт.Значение = ИформацияИзРеестра.Значение;
					 Контакт.Представление = ИформацияИзРеестра.Представление;
				ИначеЕсли ИформацияИзРеестра.Вид = Справочники.ВидыКонтактнойИнформации.ФактАдресРеестрУчебныхУчреждений И Контакт.Вид = Справочники.ВидыКонтактнойИнформации.ФактАдресУчебныеУчреждения Тогда
					 Контакт.Значение = ИформацияИзРеестра.Значение;
					 Контакт.Представление = ИформацияИзРеестра.Представление;
				КонецЕсли
			КонецЦикла
		КонецЦикла
	КонецЕсли
КонецПроцедуры

// }Рарус dotere #21382 -Заполненеие данных их реестра 2021.10.14
